In [1]:
import numpy as np
import pandas as pd

In [2]:
import seaborn as sns

In [3]:
df=sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
df.groupby("pclass").mean()

,survived,age,sibsp,parch,fare,adult_male,alone
pclass,,,,,,,
1,0.629630,38.233441,0.416667,0.356481,84.154687,0.550926,0.504630
2,0.472826,29.877630,0.402174,0.380435,20.662183,0.538043,0.565217
3,0.242363,25.140620,0.615071,0.393075,13.675550,0.649695,0.659878

In [18]:
df["survived"].groupby([df["sex"],df["pclass"]]).mean().unstack()

pclass         1         2         3
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [20]:
df["survived"].groupby([df["sex"],df["pclass"]]).value_counts().unstack()

survived         0   1
sex    pclass
female 1         3  91
       2         6  70
       3        72  72
male   1        77  45
       2        91  17
       3       300  47

In [35]:
df["sex"].value_counts()

male      577
female    314
Name: sex, dtype: int64

In [37]:
df.groupby("sex")["survived"].value_counts().unstack()

survived    0    1
sex
female     81  233
male      468  109

In [38]:
df.groupby("sex")["pclass"].value_counts().unstack()

pclass    1    2    3
sex
female   94   76  144
male    122  108  347

In [42]:
df.groupby(["sex","pclass"])["survived"].mean().unstack()

pclass         1         2         3
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [44]:
df.groupby(["sex","pclass"])["survived"].value_counts().unstack()

survived         0   1
sex    pclass
female 1         3  91
       2         6  70
       3        72  72
male   1        77  45
       2        91  17
       3       300  47

In [51]:
df["survived"].groupby([df["sex"],df["pclass"],df["class"]]).value_counts().unstack()

survived                0   1
sex    pclass class
female 1      First     3  91
       2      Second    6  70
       3      Third    72  72
male   1      First    77  45
       2      Second   91  17
       3      Third   300  47

In [52]:
# fonksiyon uygulama :

In [53]:
df_number=df.select_dtypes(["float64","int64"])

In [58]:
df_number=df_number.dropna()
df_number=df_number.head(6)
df_number=df_number.astype("int64")
df_number

   survived  pclass  age  sibsp  parch  fare
0         0       3   22      1      0     7
1         1       1   38      1      0    71
2         1       3   26      0      0     7
3         1       1   35      1      0    53
4         0       3   35      0      0     8
6         0       1   54      0      0    51

In [61]:
df_number.aggregate(["min",np.median,"max"]).T
# df_number içindeki tüm değişkenlerin en küçük, median ve max değerlerinin her biri var.

           min  median   max
survived   0.0     0.5   1.0
pclass     1.0     2.0   3.0
age       22.0    35.0  54.0
sibsp      0.0     0.5   1.0
parch      0.0     0.0   0.0
fare       7.0    29.5  71.0

In [80]:
df_number.aggregate({"survived":max,"pclass":min,"age":np.median})

survived     1.0
pclass       1.0
age         35.0
dtype: float64

In [69]:
def f(x):
    return x.mean()-x.std()

In [74]:
df_number.aggregate(f)

survived    -0.047723
pclass       0.904555
age         23.864471
sibsp       -0.047723
parch        0.000000
fare         4.041552
dtype: float64

In [83]:
df_number.aggregate(["std","mean",f]).T

                std       mean          f
survived   0.547723   0.500000  -0.047723
pclass     1.095445   2.000000   0.904555
age       11.135529  35.000000  23.864471
sibsp      0.547723   0.500000  -0.047723
parch      0.000000   0.000000   0.000000
fare      28.791781  32.833333   4.041552

In [89]:
fonksiyon=["max","mean","mean","std"]

In [93]:
df_number["age"].aggregate(fonksiyon)

max     54.000000
mean    35.000000
mean    35.000000
std     11.135529
Name: age, dtype: float64

In [110]:
df_number.aggregate({"fare":["max","min"],"pclass":"sum"}).T

         max  min   sum
fare    71.0  7.0   NaN
pclass   NaN  NaN  12.0

In [112]:
df_number.dtypes

survived    int64
pclass      int64
age         int64
sibsp       int64
parch       int64
fare        int64
dtype: object

In [113]:
df_number["survived"]=pd.Categorical(df_number.survived)

In [115]:
df_number.dtypes

survived    category
pclass         int64
age            int64
sibsp          int64
parch          int64
fare           int64
dtype: object

In [116]:
df_number["survived"]

0    0
1    1
2    1
3    1
4    0
6    0
Name: survived, dtype: category
Categories (2, int64): [0, 1]